In [2]:
import pandas as pd
import numpy as np

## CREAT DF

In [3]:
dataset = {
    "Department":["IT","HR","Production","Production","IT","HR"],
    "Employee":["Mystafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
    "Salary":[3000,3500,2500,4500,4000,2000]
}

In [4]:
df = pd.DataFrame(dataset)

In [5]:
df

   Department Employee  Salary
0          IT  Mystafa    3000
1          HR     Jale    3500
2  Production    Kadir    2500
3  Production   Zeynep    4500
4          IT    Murat    4000
5          HR    Ahmet    2000

## Group by Department

In [6]:
DepGroup = df.groupby("Department")
DepGroup

## Find total salaries by department

In [7]:
#Solution1
DepGroup.sum(1)

            Salary
Department
HR            5500
IT            7000
Production    7000

In [8]:
#Solution2

df.groupby("Department").sum(1)

            Salary
Department
HR            5500
IT            7000
Production    7000

## Find total salary IT

In [9]:
df.groupby("Department").sum(1).loc["IT"]

Salary    7000
Name: IT, dtype: int64

## count employees

In [10]:
df.groupby("Department").count()

            Employee  Salary
Department
HR                 2       2
IT                 2       2
Production         2       2

In [11]:
df.groupby("Department").max()

           Employee  Salary
Department
HR             Jale    3500
IT          Mystafa    4000
Production   Zeynep    4500

In [12]:
df.groupby("Department").min()["Salary"]["IT"]

3000